Revit 2027 API
Noise.NoiseColor2 Property
 The property labeled "Color 2" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string NoiseColor2 { get; }
Public Shared ReadOnly Property NoiseColor2 As String
	Get
public:
static property String^ NoiseColor2 {
	String^ get ();
}
static member NoiseColor2 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace